app/controllers/rides_controller.rb

SELECT "rides".* FROM "rides"
---
  def index
    @rides = Ride.all

SELECT "rides".* FROM "rides" WHERE "rides"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @ride = Ride.find(params[:id])

INSERT INTO "rides" ("created_at", "date_range", "difficulty_rating", "name", "total_distance", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @ride = Ride.new(params[:ride])

    respond_to do |format|
      if @ride.save